Dag 3 – Aggregasjoner & groupby + Hjelpefunksjoner i Script
Teori / Læringsmål
* Forstå hvordan groupby fungerer i Pandas.
* Lage aggregeringer: mean, count, sum, min, max.
* Lære å skrive små hjelpefunksjoner i script for å gjøre beregninger.

Bruk DataFrame fra Dag 2 eller lag et nytt med kolonner: Navn, Alder, Avdeling, Lønn, Sykefravær.
Gruppér etter avdeling og beregn:
* gjennomsnitt
* sum

Lag dag3.py.
* Definer en funksjon som gir gjennomsnittslønn per avdeling
* Legg til en funksjon for totalt sykefravær per avdeling.
* Kjør alt i if __name__ == "__main__": og print resultater.

In [13]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame([["Lise Hansen", 28, "HR", 550000], 
                    ["Knut Knutsen", 36, "IT", 780000], 
                    ["Arild Arildsen", 52, "Ledelse", 1020000], 
                    ["Helen Hansen", 43, "Finans", 980000], 
                    ["Stian Stiansen", 39, "Renholder", 510000]], 
                    columns=["Navn", "Alder", "Avdeling", "Lønn"])

In [9]:
nye_rader = pd.DataFrame([["Kristoffer Kristoffersen", 47, "HR", 780000], 
                    ["William Williamsen", 23, "IT", 430000], 
                    ["Helen Helensen", 38, "Ledelse", 1090000],
                    ["Boye Bojessen", 33, "IT", 1250000],
                    ["Kaja Kajessen", 29, "Finans", 750000]],
                    columns=["Navn", "Alder", "Avdeling", "Lønn"])

In [10]:
df = pd.concat([df, nye_rader], ignore_index = True)
df

                       Navn  Alder   Avdeling     Lønn
0               Lise Hansen     28         HR   550000
1              Knut Knutsen     36         IT   780000
2            Arild Arildsen     52    Ledelse  1020000
3              Helen Hansen     43     Finans   980000
4            Stian Stiansen     39  Renholder   510000
5  Kristoffer Kristoffersen     47         HR   780000
6        William Williamsen     23         IT   430000
7            Helen Helensen     38    Ledelse  1090000
8             Boye Bojessen     33         IT  1250000
9             Kaja Kajessen     29     Finans   750000

In [14]:
df["Sykefraværs_dager"] = np.random.randint(0,11, size=len(df))

In [12]:
df.groupby("Avdeling")["Lønn"].mean()

Avdeling
Finans        865000.0
HR            665000.0
IT            820000.0
Ledelse      1055000.0
Renholder     510000.0
Name: Lønn, dtype: float64

In [17]:
df.groupby("Avdeling").agg({
    "Lønn": ["mean", "max", "min"],
    "Sykefraværs_dager": ["mean", "sum"]
})

                Lønn                   Sykefraværs_dager
                mean      max      min              mean sum
Avdeling
Finans      865000.0   980000   750000               3.0   6
HR          665000.0   780000   550000               5.5  11
IT          820000.0  1250000   430000               5.0  15
Ledelse    1055000.0  1090000  1020000               3.5   7
Renholder   510000.0   510000   510000               0.0   0